# Intro to Pandas Library

The pandas library consist mostly of two data types:
- Series
- DataFrames: A 2D object to represent 'tabular' data

## DataFrames Charateristics
- Mutable
- Index based
- A full class of its own

## Classic data representation formats
- JSON
- CSV

In [3]:
import pandas as pd

In [17]:
# Create a new dataFrame 
df_one = pd.DataFrame(columns=['Column1', 'Column2'])
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [21]:
# Another way
df_one.columns = ['First', 'Second']
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [18]:
# Add some rows
data1 ={
    'First': [1, 2, 'Real'], # key = column, values = list of data
    'Second': [22, 44, 'Madrid']
}
# Create new df with data
df_two = pd.DataFrame(data1)
df_two

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [23]:
# Combine two dfs
df_three = pd.concat([df_one, df_two])
df_three

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [27]:
# Add data to df_one
data = {
    'First': [66, 77, 'Hello'],
    'Second': [88, 99, 'CS4580']
}
# Add it to frame
df_one = pd.DataFrame(data)
# Combine them
df_three = pd.concat([df_one, df_two])
df_three

   First  Second
0     66      88
1     77      99
2  Hello  CS4580
0      1      22
1      2      44
2   Real  Madrid

In [28]:
# Update indexes as you combine them
df_three.reset_index(drop=True, inplace=True)
df_three

   First  Second
0     66      88
1     77      99
2  Hello  CS4580
3      1      22
4      2      44
5   Real  Madrid

In [34]:
# Add df colum-wise
col_data = {
    'Third': [88,99, 11]
}
df_four = pd.DataFrame(col_data)
# Now combine them by columns, add the axis=1 parameter
df_combined = pd.concat([df_three, df_four], axis=1)
df_combined

   First  Second  Third
0     66      88   88.0
1     77      99   99.0
2  Hello  CS4580   11.0
3      1      22    NaN
4      2      44    NaN
5   Real  Madrid    NaN

## Task: Sales Data

In [60]:
# TODO: Define a df called df_sales with two columns: Date and amount of sales
df_sales = pd.DataFrame(columns=['Date', 'Amount'])
# TODO:Add some data: 3 rows
data = {
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03'],
    'Amount': [98, 156, 203]
}
df_sales = pd.DataFrame(data)
# TODO: Create a new df with two more rows of data, same columns as df_sales
df_new = pd.DataFrame(columns=['Date', 'Amount'])
data1 = {
    'Date': ['2024-01-04', '2024-01-05'],
    'Amount': [108, 47]
}
df_new = pd.DataFrame(data1)
# TODO: Combine them, and make sure indexes are correct
df_sales = pd.concat([df_sales, df_new])
df_sales.reset_index(drop=True, inplace=True)
# TODO: Add a new column called: 'Product' with 4 rows of data, and combine it to original df_sales
col_data = {
    'Product': ['A', 'B', 'A', 'C']
}
df_col = pd.DataFrame(col_data)
df_sales = pd.concat([df_sales, df_col], axis=1)
df_sales

         Date  Amount Product
0  2024-01-01      98       A
1  2024-01-02     156       B
2  2024-01-03     203       A
3  2024-01-04     108       C
4  2024-01-05      47     NaN

## Working with JSON Files
You can handle JSON files directly with Pandas, using the read_json() method.

In [5]:
import pandas as pd
# Load json file
df_json_data = pd.read_json('../data/example-1.json')

In [7]:
# Display df
df_json_data

   Column 1  Column 2
0         1         2
1         3         4
2         5         6

In [8]:
# Convert dataFrame to json formatted string
json_format = df_json_data.to_json()
json_format

'{"Column 1":{"0":1,"1":3,"2":5},"Column 2":{"0":2,"1":4,"2":6}}'

## Working with CSV Files
With Pandas use the `read_csv()` method

In [9]:
df_csv_format = pd.read_csv('../data/example-1.csv')
# Display it
df_csv_format

     Branch       Date  Amount
0  Branch A  January 1   500.0
1  Branch B  January 2   250.0
2  Branch A  January 3   300.0

In [10]:
# Read file without header record
df_csv_format = pd.read_csv('../data/example-1.csv', header=None)
df_csv_format

          0          1       2
0    Branch       Date  Amount
1  Branch A  January 1  500.00
2  Branch B  January 2  250.00
3  Branch A  January 3  300.00

In [11]:
# Save the data back to csv file
# If you do not need the index information, use, index=None
df_csv_format.to_csv('test.csv', index=None)